from aiogram import Bot
from aiogram.exceptions import TelegramAPIError

from app.config import Config

ONE_TIME_TEXT = (
    "Всем привет!\n"
    "У меня появились важные обновления. Хочу ими с вами поделиться:\n\n"
    "➡️ Раньше, если вы начинали со мной диалог и в какой-то момент прекращали"
    " - я мог ждать вас вечно, ни на что не реагируя, пока вы не продолжите "
    "или не нажмете /cancel. "
    "Теперь я жду 20 минут и автоматически все забываю.\n\n"
    "➡️ За час до начала занятия я буду стараться напомнить вам о записи в личных сообщениях. "
    "Если напоминание не приходит - скорее всего, мы с вами ещё ни разу не общались в личке "
    "(я не могу написать первым), либо вы закрыли мне доступ в настройках. "
    "Чтобы напоминания работали, просто напишите мне что-нибудь в личных сообщениях.\n\n"
    "➡️ А еще я пошел учиться в школу йогов и хочу делиться с вами тем, что узнаю. "
    "Раз в сутки я буду присылать что-то самое интересное из выученного. "
    "Если сегодня я этого не сделал - наверное, просто уснул в шавасане. "
    "Но завтра обязательно наверстаю.\n\n🧘‍♂️"
)

RUN_TIME_DATE = "2026-07-05 21:00:00"


async def send_one_time_text(bot: Bot, config: Config) -> None:
    try:
        await bot.send_message(chat_id=config.bot.group_id, text=ONE_TIME_TEXT)
    except TelegramAPIError as e:
        pass
